digbank_tests/performance/CreateSavingsAccount_execution.yml
---
settings:
    env:
      BASE_URL: http://34.74.85.46:8082
reporting:
  - module: junit-xml
    filename: result.xml
    data-source: pass-fail
modules:
  cloud:
    report-name: CreateSavingsAccount Test Report
    test: CreateSavingsAccount Test
execution:
  - scenario: Create Savings Account TC 1 - Individual Money Market Not Created - Minimum Deposit Not Met
    concurrency: 2
    ramp-up: 1s
    hold-for: 2m
    iterations: -1
  - scenario: Create Savings Account TC 2 - Individual Money Market Not Created - Initial Deposit Less Than Zero
    concurrency: 2
    ramp-up: 1s
    hold-for: 2m
    iterations: -1
  - scenario: Create Savings Account TC 3 - Individual Money Market Created
    concurrency: 2
    ramp-up: 1s
    hold-for: 2m
    iterations: -1
  - scenario: Create Savings Account TC 4 - Individual Savings Created
    concurrency: 2
    ramp-up: 1s
    hold-for: 2m
    iterations: -1
  - scenario: Create Savings Account TC 5 - Data Validation Error
    concurrency: 2
    ramp-up: 1s
    hold-for: 2m
    iterations: -1